<template>
    <div :id = "$style.primary">
        <div :id = "$style.foreign">
            <div :id = "$style.M"> 
                <img src = "src\assets\pic5.svg" />
                <p>
                    Добро пожаловать в Летний Дворец! <br> <br>
                    Всего в 12 километрах от Петербурга, неподалеку от знаменитых фонтанов и парков Петергофа воплощен в жизнь один из самых грандиозных проектов event-индустрии России – ресторанный комплекс «Летний Дворец». Открытый в 2009 году, он объединил под одной крышей современный банкетный зал в исторических дворцовых интерьерах на 800 гостей и собственный кейтеринг.
                </p>
            </div>
            <div :id = "$style.A"> 
                <img src = "src\assets\pic1.svg" />
                <pre>     ПЛОЩАДКА</pre>
                <p>
                    Сочетание классических интерьеров и современных технических возможностей выгодно отличают Летний Дворец от большинства других исторических площадок города.
                </p>
            </div>
            <div :id = "$style.B">
                <img src = "src\assets\pic2.svg" />
                <pre>     ИНТЕРЬЕРЫ</pre> 
                <p>
                    Изысканное внутреннее убранство Летнего Дворца — тонко выполненная стилизация с использованием традиционных технологий и материалов — мрамора, бронзового литья.
                </p>
            </div>
            <div :id = "$style.C"> 
                <img src = "src\assets\pic3.svg" />
                <pre>     ТЕХНОЛОГИИ</pre> 
                <p>
                    Возможности «Летнего Дворца» практически безграничны с точки зрения проведения мероприятий самого разного формата и масштаба.
                </p>
            </div>
            <div :id = "$style.D"> 
                <img src = "src\assets\pic4.svg" />
                <pre>     ОБОРУДОВАНИЕ</pre> 
                <p>
                    Установлен комплект самого современного звукового оборудования, который приятно удивит даже знатока качественного звука.
                </p>
            </div>
        </div>
    </div>
</template>

<style module>
    #primary {
        background-color: #F6F4F4;
    }

    #foreign {
        width: 70%;
        margin: auto auto;
        display: grid; 
        grid-column-gap: 4%;
    }

    #M {
        grid-area: 1 / 2 / 5 / 3;
        text-align: center;
    }

    #M p {
        text-align: left;
    }
 
    #A {
        grid-area: 1 / 3 / 3 / 4;
    }

    #B {
        grid-area: 1 / 4 / 3 / 5;
    }

    #C {
        grid-area: 3 / 3 / 5 / 4;
    }

    #D {
        grid-area: 3 / 4 / 5 / 5;
    }

    #foreign * {
        font-family: "Trebuchet MS"; 
        color: #616161;
    }
    
    #foreign pre {
        display: inline;
        color: #000000;
    }
</style>